# Epam-practice6
Tasks from the sixth practice class of EPAM java course at spring 2019.


Практическое задание №6
_______________________

Замечания.

(1) Везде в коде, при реализации функциональных интерфейсов использовать лямбда выражения или ссылки на методы.

(2) Помните, что контейнеры HashSet/ТгееSet не контролируют потенциальное появление дубликатов при изменении состояния объектов, которые в них хранятся, то же касается и ключей контейнеров HashMap/ТгееМар.

(3) В задании 3 под словом понимать непрерывную последовательность букв латинского алфавита.


Задание 1
-------------------------------------------------------
Пакет: ua.nure.your_last_name.practice6.part1
Классы:
Part1 - содержит моделирование консольного ввода/вывода и вызов метода WordContainer.main
WordContainer - содержит требуемую по условию функциональность
Word - поставлен в соответствие сущности 'слово с информацией о его частоте в тексте'.
-------------------------------------------------------

Разработать приложение, которое считывает текст из консольного ввода и выводит слова в порядке убывания частоты их появления в тексте (при совпадении частот порядок - лексикографический).
Под словами понимать непрерывную последовательность непробельных символов.

Решить задачу с применением ООП подхода.

Класс Word, содержит строковое поле content и целое поле frequency, контейнер WordContainer агрегирует объекты Word.

При использовании контейнерных классов из ядра грамотно реализовать (если они будут нужны) методы Word#equals / Word#hashCode / Word#compareTo.

При запуске WordContainer.main осуществляет чтение из стандартного потока ввода (консоли). Консольный ввод в общем случае может содержать несколько строк, в каждой строке может быть несколько слов. Признаком завершения консольного ввода служит слово stop.

Продемонстрировать работу приложения (Part1.main).

Пример входной информации
-------------------------------------------------------
asd asdf asd asdf asdf 
43 asdsf 43 43
434 stop
-------------------------------------------------------

Пример выходной информации
-------------------------------------------------------
43 : 3
asdf : 3
asd : 2
434 : 1
asdsf : 1
-------------------------------------------------------
_______________________
Задание 2
-------------------------------------------------------
Пакет: ua.nure.your_last_name.practice6.part2
Название класса: Part2
-------------------------------------------------------

Написать программу, которая моделирует следующий процесс.

В кругу стоят n человек, пронумерованных от 0 до n-1.
При ведении счета по кругу вычеркивается каждый k-й человек (0<k<n), пока не останется один.

Пример для n=7 и k=3.
Начальное состояние:
0123456
Итерации:
013456
01346
0346
034	
03
3

Написать метод удаления элемента с помощью итератора [Iterator#remove()]:
-------------------------------------------------------
// метод возвращает время работы
public static long removeByIterator(List<Integer> list, int k) {}
-------------------------------------------------------

Сравнить время работы на одинаковых входных данных (задавать в Part2.main) с использованием объектов ArrayList и LinkedList.
В качестве входных данных использовать n=10000, k=4.

Продемонстрировать работу приложения (Part2.main)

Пример выходной информации (придерживаться данного формата):
-------------------------------------------------------
ArrayList#Iterator: 20 ms
LinkedList#Iterator: 15 ms
-------------------------------------------------------
Задание 3
-------------------------------------------------------
Пакет: ua.nure.your_last_name.practice6.part3
Класс: Part3 (принимает параметры командной строки)
Входную информацию загружать из файла part3.txt (должен находится в корне проекта)
-------------------------------------------------------

Реализовать консольное приложение (Part3) которое анализирует текст.

Формат входных параметров командной строки для приложения (программа должна понимать как короткие, так и длинные опции):
-------------------------------------------------------
-i (или --input) путь к входному файлу;
-t (или --task) наименование подзадачи.
-------------------------------------------------------

Всего параметров командной строки 4, т.е. две пары <имя_опции значение_опции>.
Порядок следования опций с их значениями прооизвольный.

Примеры параметров командной строки для запуска приложения:
-------------------------------------------------------
-i input.txt -t length
--input input.txt --task length
-------------------------------------------------------

В методе Demo.main смоделировать передачу параметров командной строки в метод Part4.main:
-------------------------------------------------------
System.out.println("~~~~~~~~~~~~Part3");
Part3.main(new String[] {"--input", "part3.txt", "--task", "length"});
Part3.main(new String[] {"--input", "part3.txt", "--task", "duplicates"});
-------------------------------------------------------

Подзадач всего две: length, duplicates.

Подзадача Part 1 (length)
-------------------------------------------------------
Название класса: ua.nure.your_last_name.practice6.part3.Part31
-------------------------------------------------------

Во входном файле найти три самых длинных слова и распечатать их в формате: слово ==> количество букв в слове. Список должен быть отсортирован по убыванию количества букв в слове.

Если у двух слов количество букв совпадает, то слово, которое было в исходном файле раньше, должно в результирующем списке находиться также раньше.

Пример вывода
-------------------------------------------------------
anesthetist ==> 11
kitchen ==> 7
bird ==> 4
-------------------------------------------------------

Подзадача Part 2 (duplicates)
-------------------------------------------------------
Название класса: ua.nure.your_last_name.practice6.part3.Part32
-------------------------------------------------------

Во входном файле найти первые три слова, которые имеют дубликаты, и напечатать их инверсию в верхнем регистре.

Пример вывода
-------------------------------------------------------
ADNAP
TAC
ENIGREBUA
-------------------------------------------------------
